var meal;

function getMeal() {
  meal = [
    {
      id: 1,
      name: "黑芝麻红枣粥",
      food: [
        "黑芝麻", "红枣", "大米", "糖"
      ],
      weight: ["25 克", "25 克", "50 克", "100 克"]
    },
    {
      id: 2,
      name: "黑米黑芝麻汤圆",
      food: ["汤圆粉", "黑米", "黑芝麻", "糖", "猪油"],
      weight: ["少许", "少许", "少许", "少许", "少许"]
    },
    {
      id: 3,
      name: "炒河虾",
      food: ["河虾", "青尖椒", "红尖椒", "油", "蒜蓉", "盐", "味精"],
      weight: ["400 克", "1 个", "1 个", "适量", "适量", "适量", "适量"]
    },
    {
      id: 4,
      name: "鲜虾香芒盏",
      food: ["大芒果", "鲜虾仁", "西芹", "胡萝卜", "炸腰果仁", "油", "料酒", "水淀粉", "味精"],
      weight: ["1 个", "80 克", "30 克", "30 克", "30 克", "适量", "适量", "适量"]
    },
    {
      id: 5,
      name: "山竹炒虾仁",
      food: ["山竹", "虾", "盐", "蛋清", "油", "淀粉", "莱姆酒"],
      weight: ["600 克", "300 克", "适量", "适量", "适量", "适量", "适量"]
    },
    {
      id:6,
      name:"荔枝虾仁",
      food: ["荔枝","鲜虾","油","熟鸡油","清汤","淀粉","盐","料酒","米醋","鸡蛋清"	,"葱","姜"],
      weight: ["250 克","200 克","500 毫升","10 毫升","50 毫升","25 克","4 克","25 毫升","2 毫升","少许","少许","少许"]
    },
    {
      id: 7,
      name: "丝瓜虾皮蛋汤",
      food: ["嫩丝瓜", "虾皮", "鸡蛋", "香油", "盐", "味精"],
      weight: ["200克", "15克", "2个", "适量", "适量", "适量"]
    },
    {
      id: 8,
      name: "海米豇豆",
      food: ["豇豆", "海米", "料酒", "盐", "味精", "水淀粉", "油"],
      weight: ["500克", "50克", "适量", "适量", "适量", "适量", "适量"]
    },
    {
      id: 9,
      name: "蒜苗炒山药",
      food: ["山药", "蒜苗", "油", "盐", "味精", "鲜汤", "料酒"],
      weight: ["300克", "100克", "适量", "适量", "适量", "适量", "适量"]
    },
    {
      id: 10,
      name: "芡实蒸蛋羹",
      food: ["芡实", "鸡蛋", "鸡肉", "青虾", "香菇", "鸡汤", "料酒", "盐", "酱油"],
      weight: ["15克", "4个", "100克", "10只", "5个", "1500毫升", "适量", "适量", "适量"]
    },
    {
      id: 11,
      name: "芡实煮老鸭",
      food: ["芡实", "老鸭", "盐", "料酒", "味精"],
      weight: ["200克", "1只", "适量", "适量", "适量"]
    },
    {
      id: 12,
      name: "黄白烩鸡丁",
      food: ["山药", "玉米", "鸡胸肉", "鸡蛋", "鸡汤", "面粉", "油", "香油", "淀粉", "盐", "糖"],
      weight: ["150克", "150克", "150克", "1个", "100毫升", "15克", "25毫升", "10毫升", "40克", "3克", "25克"]
    },
    {
      id: 13,
      name: "紫菜骨髓汤",
      food: ["牛骨髓", "紫菜", "香菜", "清汤", "盐", "味精", "油", "葱花", "姜丝", "酱油", "米醋", "香油"],
      weight: ["150克", "10克", "5克", "750毫升", "2克", "2克", "适量", "少许", "少许", "少许", "少许", "少许"]
    },
    {
      id: 14,
      name: "豇豆烧五花肉",
      food: ["豇豆", "猪五花肉", "熟猪油", "盐", "酱油", "料酒", "味精", "香油"],
      weight: ["400克", "100克", "适量", "适量", "适量", "适量", "适量", "适量"]
    },
    {
      id: 15,
      name: "腐皮肉卷",
      food: ["猪五花肉馅", "鲜豆腐皮", "面粉糊", "盐", "味精", "香油", "料酒"],
      weight: ["250克", "2张", "少许", "适量", "适量", "适量", "适量"]
    },
    {
      id: 16,
      name: "海带炖冻豆腐",
      food: ["冻豆腐", "海带", "木耳", "油", "盐", "味精", "鲜汤", "香油"],
      weight: ["250克", "300克", "20克", "少许", "少许", "少许", "少许", "少许"]
    },
    {
      id: 17,
      name: "黑白甜饭",
      food: ["黑米", "糯米", "熟猪油", "蜂蜜", "白糖", "冰糖"],
      weight: ["50克", "50克", "适量", "少许", "100克", "75克"]
    },
    {
      id: 18,
      name: "煎黑米藕夹",
      food: ["鲜藕", "黑米", "鸡糜", "鸡蛋", "淀粉", "盐", "味精"],
      weight: ["500克", "100克", "50克", "3个", "60克", "适量", "适量"]
    },
    {
      id: 19,
      name: "枸杞党参乌鸡汤",
      food: ["乌鸡", "枸杞", "党参", "盐", "味精", "料酒"],
      weight: ["1只", "15克", "适量", "适量", "适量", "适量"]
    },
    {
      id: 20,
      name: "三鲜黑米蛋卷",
      food: ["黑米饭", "熟火腿", "水淀粉", "水发冬菇", "水发虾米", "鸡蛋", "熟鸡脯肉", "盐", "味精", "香油", "熟猪油"],
      weight: ["400克", "50克", "50克", "50克", "20克", "4个", "100克", "适量", "适量", "适量", "适量"]
    },
    {
      id: 21,
      name: "滑炒鱼丝",
      food: ["活乌鱼", "笋尖", "油", "盐", "味精", "料酒", "淀粉", "蛋清"],
      weight: ["1条", "适量", "适量", "适量", "适量", "适量", "适量", "适量"]
    },
    {
      id: 22,
      name: "枸杞鹿茸乌鸡汤",
      food: ["乌鸡", "枸杞", "鹿茸片", "盐", "姜"],
      weight: ["1只", "25克", "25克", "少许", "少许"]
    },
    {
      id: 23,
      name: "芦笋海参汤",
      food: ["芦笋", "水发海参", "油", "盐", "味精"],
      weight: ["50克", "100克", "适量", "适量", "适量"]
    },
    {
      id: 24,
      name: "鸡丝裙带菜汤",
      food: ["鸡胸肉", "裙带菜", "香菜", "鸡蛋", "淀粉", "清汤", "盐", "油", "姜", "生抽", "味精", "料酒"],
      weight: ["150克", "100克", "15克", "1个", "25克", "750毫升", "2克", "适量", "少许", "少许", "少许", "少许"]
    },
    {
      id: 25,
      name: "青豆蛋黄菜花汤",
      food: ["鸡蛋", "菜花", "青豌豆", "油", "盐", "味精", "香菜末", "骨头汤"],
      weight: ["2个", "200克", "25克", "10克", "适量", "适量", "适量", "适量"]
    },
    {
      id: 26,
      name: "丝瓜瘦肉汤",
      food: ["猪瘦肉", "丝瓜", "水发木耳", "盐", "味精", "淀粉", "油"],
      weight: ["150克", "300克", "少许", "少许", "少许", "少许", "少许"]
    },
    {
      id: 27,
      name: "山药鱼片汤",
      food: ["山药", "鱼肉", "海带", "豆腐", "盐", "葱花", "胡椒粉"],
      weight: ["20克", "250克", "适量", "适量", "适量", "适量", "适量"]
    },
    {
      id: 28,
      name: "荷叶瘦肉汤",
      food: ["荷叶", "柠檬", "瘦肉", "莲子", "薏仁", "鸡内金", "盐"],
      weight: ["3块", "4片", "200克", "15克", "20克", "10克", "适量"]
    },
    {
      id: 29,
      name: "莲子百合瘦肉汤",
      food: ["猪瘦肉", "莲子", "百合", "料酒", "盐", "味精", "肉汤", "油", "姜", "葱"],
      weight: ["200克", "15克", "15克", "适量", "适量", "适量", "适量", "适量", "适量", "适量"]
    },
    {
      id: 30,
      name: "紫菜瑶柱蛋白羹",
      food: ["紫菜", "瑶柱", "鸡蛋", "盐", "油", "味精"],
      weight: ["200克", "50克", "2个", "适量", "适量", "适量"]
    },
    {
      id: 31,
      name: "玄参生地乌鸡汤",
      food: ["乌鸡", "玄参", "生地", "盐"],
      weight: ["1只（约", "9克", "15克", "适量"]
    },
    {
      id: 32,
      name: "海马童子鸡",
      food: ["童子鸡", "海马", "虾仁", "料酒", "豆粉", "鲜汤", "味精", "盐"],
      weight: ["1只", "10克", "15克", "10毫升", "10克", "500毫升", "适量", "适量"]
    }, {
      id: 33,
      name: "石耳炖鸡",
      food: ["净母鸡", "石耳", , "火腿骨", "盐", "料酒", "油", "葱", "姜"],
      weight: ["1只", "50克", "5克", "5克", "15毫升", "25毫升", "适量", "适量"]
    },
    {
      id: 34,
      name: "徽州蒸鸡",
      food: ["肥母鸡", "板栗", "酱油", "料酒", "鸡汤", "盐", "冰糖"],
      weight: ["1只", "200克", "适量", "适量", "适量", "适量", "适量"]
    },
    {
      id: 35,
      name: "鸡腿扒乌参",
      food: ["海参", "鸡腿", "冬笋", "盐", "虾米", "火腿", "油", "酱油", "料酒", "糖色", "味精", "水淀粉", "鸡清汤"],
      weight: ["150克", "750克", "400克", "10克", "10克", "20克", "100毫升", "50毫升", "25克", "15克", "少许", "少许", "适量"]
    },
    {
      id: 36,
      name: "木耳拌鸡片",
      food: ["鸡片", "水发木耳", "柠檬汁", "姜汁", "橄榄油", "盐和醋"],
      weight: ["200克", "150克", "适量", "适量", "适量", "适量"]
    },
    {
      id: 37,
      name: "黄精蒸鸡",
      food: ['母鸡', "山药", "黄精", "党参", "盐", "味精"],
      weight: ["1000克", "30克", "30克", "30克", "适量", "适量"]
    },
    {
      id: 38,
      name: "黑枣炖乌鸡",
      food: ["乌鸡", "黑枣", "料酒", "香油", "姜", "葱", "盐", "味精"],
      weight: ["1只", "100克", "10毫升", "35毫升", "适量", "适量", "适量", "适量"]
    },
    {
      id: 39,
      name: "豉汁腐竹",
      food: ["腐竹", "豆豉", "玉米淀粉", "盐", "糖", "味精", "油", "香油", "花椒", "八角", "姜末"],
      weight: ["200克", "30克", "10克", "3克", "3克", "2克", "50毫升", "10毫升", "适量", "适量", "适量"]
    },
    {
      id: 40,
      name: "五色炒玉米",
      food: ["玉米", "豌豆", "香菇", "红辣椒", "竹笋", "冬笋", "料酒", "盐", "味精", "鲜奶油", "水淀粉", "汤"],
      weight: ["1根", "适量", "适量", "适量", "适量", "适量", "适量", "适量", "适量", "适量", "适量", "适量"]
    },
    {
    	id:41,
    	name:"黄豆芽炖豆腐",
    	food: ["黄豆芽","北豆腐","油","盐","味精","香油","清汤"],
        weight: ["250 克","300 克","40 毫升","5 克","3 克","10 毫升","200 毫升"]
    },
    {
    	id:42,
    	name:"草鱼豆腐汤",
    	food: ["草鱼","豆腐","菜心","盐","胡椒粉","料酒","食用油","鲜汤"],
        weight: ["1 条","250 克","6 棵","适量","适量","适量","适量","适量"]
    },
    {
    	id:43,
    	name:"紫菜虾干汤",
    	food: ["虾干","白菜叶","紫菜","鸡蛋","油","盐","味精","香油"],
        weight: ["50 克","50 克","25 克","1 个","少许","少许","少许","少许"]
    },
    {
    	id:44,
    	name:"豆腐猪血汤",
    	food: ["猪血","红枣","豆腐","味精","香油","盐"],
        weight: ["250 克","10 枚","1 块","适量","适量","适量"]
    },
    {
    	id:45,
    	name:"酿鲫鱼豆腐汤",
    	food: ["鲫鱼","豆腐","猪肉馅","油","葱","姜末","蒜","盐","高汤","味精","料酒"],
        weight: ["1 条","1 块","50 克","少许","少许","少许","少许","少许","少许","少许","少许"]
    },
    {
    	id:46,
    	name:"虾丸蘑菇汤",
    	food: ["鲜蘑菇","虾仁","菜心","料酒","盐","味精","鲜汤"],
        weight: ["250 克","150 克","150 克","适量","适量","适量","适量"]
    },
    {
    	id:47,
    	name:"清蒸带鱼",
    	food: ["带鱼","料酒","酱油","香油","香菜"],
        weight: ["500 克","适量","适量","适量","适量"]
    },
    {
    	id:48,
    	name:"清蒸鱼头鱼尾",
    	food: ["草鱼头","菠菜","盐","味精","油","香油","酱油"],
        weight: ["800 克","250 克","适量","适量","适量","适量","适量"]
    },
    {
    	id:49,
    	name:"煎蒸带鱼块",
    	food: ["带鱼","鸡蛋","面粉","油","盐","料酒","味精","清汤"],
        weight: ["500 克","2 个","50 克","适量","适量","适量","适量","适量"]
    },
    {
    	id:50,
    	name:"鲫鱼蒸蛋",
    	food: ["鲫鱼","鸡蛋","油","香油","盐","酱油","料酒","味精","鲜汤"],
        weight: ["500 克","2 个","50 克","适量","适量","适量","适量","适量","适量"]
    },
    {
    	id:51,
    	name:"清蒸醉虾",
    	food: ["鲜虾","料酒","酱油","味精","香油"],
        weight: ["500 克","适量","适量","适量","适量"]
    },
    {
    	id:52,
    	name:"生菜鲮鱼球粥",
    	food: ["大米","鲮鱼滑","生菜","盐","油"],
        weight: ["250 克","500 克","适量","适量","适量"]
    },
    {
    	id:53,
    	name:"柴鱼花生粥",
    	food: ["猪骨","柴鱼干","带皮花生","姜","油","盐"],
        weight: ["500 克","3~","250 克","1 块","适量","适量"]
    },
    {
    	id:54,
    	name:"艇仔粥",
    	food: ["大米","鲜鱿鱼","猪肚","猪肉皮","籼米粉","花生仁","干贝","盐","味精","酱油","油","食用碱水"],
        weight: ["100 克","100 克","300 克","50 克","50 克","50 克","25 克","适量","适量","适量","适量","适量"]
    },
    {
    	id:55,
    	name:"苋菜小银鱼粥",
    	food: ["稠粥","苋菜","小银鱼","盐","料酒"],
        weight: ["1 碗","25 克","100 克","适量","适量"]
    },
    {
    	id:56,
    	name:"韭菜海参粥",
    	food: ["韭菜","海参","大米","盐"],
        weight: ["60 克","60 克","100 克","适量"]
    },
    {
    	id:57,
    	name:"鲩鱼片香菜粥",
    	food: ["鲩鱼腩","鲩鱼肉","大米","腐竹","香菜","姜","油","盐","糖","陈皮"],
        weight: ["320 克","240 克","120 克","20 克","20 克","2片","适量","适量","少许","少许"]
    },
    {
    	id:58,
    	name:"鲩鱼片香菜粥",
    	food: ["鲩鱼腩","鲩鱼肉","大米","腐竹","香菜","姜","油","盐","糖","陈皮"],
        weight: ["320 克","240 克","120 克","20 克","20 克","2片","适量","适量","少许","少许"]
    },
    {
    	id:59,
    	name:"鱼生粥",
    	food: ["海蜇皮","油炸花生米","大米","青鱼肉","酱油","料酒","香菜","香油","盐","味精"],
        weight: ["100 克","100 克","500 克","500 克","50 毫升","15 毫升","适量","适量","适量","适量"]
    },
    {
    	id:60,
    	name:"黑豆桂圆粥",
    	food: ["鱼肉","玉米","大米","盐"],
        weight: ["100 克","30 克","50 克","适量"]
    },
    {
    	id:61,
    	name:"玉米鱼肉稀粥",
    	food: ["大米","黑豆","桂圆肉","蜂蜜"],
        weight: ["100 克","50 克","100 克","10 毫升"]
    },
    {
    	id:62,
    	name:"鱼片蒸豆腐",
    	food: ["大米","黑豆","桂圆肉","蜂蜜"],
        weight: ["200 克","100 克","适量","适量"]
    },
    {
    	id:63,
    	name:"龙鱼烧豆腐",
    	food: ["豆腐","龙鱼","料酒","酱油","糖","盐","味精","油","淀粉","汤"],
        weight: ["2 块","150 克","5 毫升","5 毫升","4 克","适量","适量","适量","适量","适量"]
    },
    {
    	id:64,
    	name:"地耳烧豆腐",
    	food: ["地耳","豆腐","糖","油","蚝油","酱油","清汤","水淀粉","香油"],
        weight: ["10 克","400 克","10 克","适量","适量","适量","适量","适量","适量"]
    },
    {
    	id:65,
    	name:"蒸酿豆腐",
    	food: ["鱼脊肉","板豆腐","肥肉","虾米","冬菇","香菜","果皮","糖","生抽","香油","淀粉"],
        weight: ["150 克","6 块","35 克","30 克","1 个","2 根","适量","适量","适量","适量","适量"]
    },
    {
    	id:66,
    	name:"鱼头冻豆腐",
    	food: ["胖鱼头","冻豆腐","豆瓣","青菜","蒜苗","辣椒","水发木耳","油","酱油","糖","味精","盐","料酒"],
        weight: ["1 个","2 块","适量","适量","适量","适量","适量","适量","适量","适量","适量","适量","适量"]
    },
    {
    	id:67,
    	name:"香菇烧豆腐",
    	food: ["豆腐","发好的香菇","火腿","葱花","盐","番茄酱","水淀粉","味精","糖","酱油","油"],
        weight: ["1 块","150 克","50 克","适量","适量","适量","适量","适量","适量","适量","适量"]
    },
    {
    	id:68,
    	name:"郊外大鱼头",
    	food: ["鳙鱼头","嫩豆腐","猪肉丝","小白菜","香菇丝","淀粉","料酒","蚝油","老抽","盐","味精","糖","汤","油"],
        weight: ["1 块","250 克","75 克","400 克","25 克","40 克","15 毫升","15 毫升","15 毫升","5克","5克","5克","85毫升","2000毫升"]
    },
    {
    	id:68,
    	name:"橙汁豆腐羹",
    	food: ["老豆腐","香橙","猪肉末","料酒","盐","味精","淀粉","糖及油"],
        weight: ["250 克","1 个","50 克","适量","适量","适量","适量","适量"]
    },
    {
    	id:69,
    	name:"翡翠豆腐",
    	food: ["豆腐","莴笋","味精","盐","油"],
        weight: ["250 克","250 克","1 克","5 克","适量"]
    },
    {
    	id:70,
    	name:"酿蛋黄豆腐",
    	food: ["豆腐","鸭蛋黄","油","清汤","水淀粉","料酒","酱油","盐","香油"],
        weight: ["300 克","6 个","适量","适量","适量","适量","适量","适量","适量"]
    },
    {
    	id:71,
    	name:"丝瓜炒豆腐",
    	food: ["豆腐","丝瓜","盐","味精","淀粉","油","酱油","汤"],
        weight: ["1000 克","700 克","15 克","3 克","30 克","100 毫升","35 毫升","适量"]
    },
    {
    	id:72,
    	name:"白果炒鱼花",
    	food: ["白果","草鱼","黑木耳","芹菜","鸡蛋清","淀粉","碱","油","盐","味精","高汤","料酒"],
        weight: ["70 克","200 克","75 克","50 克","40 毫升","5 克","1 克","20 毫升","2 克","2 克","100 毫升","5 毫升"]
    },
    {
    	id:73,
    	name:"焖黄鱼",
    	food: ["大黄鱼","猪腿肉","竹笋","料酒","酱油","油","鲜汤","糖","味精"],
        weight: ["500 克","75 克","50 克","25 毫升","15 毫升","40 毫升","200 毫升","适量","适量"]
    },
    {
    	id:74,
    	name:"红枣北芪炖鲈鱼",
    	food: ["鲈鱼","黄芪","干红枣","料酒","盐"],
        weight: ["600 克","25 克","20 克","5 毫升","4 克"]
    },
    {
    	id:75,
    	name:"浓汤裙带菜煮鲈鱼",
    	food: ["鲈鱼","山药","裙带菜","枸杞","油","盐","糖"],
        weight: ["1 条","200 克","100 克","10 克","15 毫升","适量","适量"]
    },
    {
    	id:76,
    	name:"白汤鲫鱼",
    	food: ["鲫鱼","熟笋片","熟火腿片","水发香菇","料酒","盐","味精","油"],
        weight: ["2 条","50 克","25 克","25 克","50 毫升","2 克","75 毫升"]
    },
    {
    	id:77,
    	name:"雪花鱼丝羹",
    	food: ["大黄鱼","火腿","冬笋","水发香菇","淀粉","鸡蛋清","油","水淀粉","盐","味精","白汤"],
        weight: ["600 克","15 克","75 克","5 克","30 克","25 毫升","15 毫升","适量","适量","适量","适量"]
    },
    {
    	id:78,
    	name:"五彩鱼片",
    	food: ["草鱼","甜红椒","香菜","紫菜","酱油","料酒","盐","味精"],
        weight: ["1 条","1 个","5 克","10 克","10 毫升","10 毫升","适量","适量"]
    },
    {
    	id:79,
    	name:"萝卜汆鲫鱼",
    	food: ["鲫鱼","白萝卜","盐","料酒","味精","油","醋"],
        weight: ["1 条","150 克","3 克","20 毫升","2 克","75 毫升","10 毫升"]
    },
    {
    	id:80,
    	name:"炖奶鲫鱼",
    	food: ["鲫鱼","火腿","竹笋","牛奶","豆苗","香菇","料酒","汤","盐","糖"],
        weight: ["2 条","15 克","15 克","1 杯","15 克","5 克","8 毫升","1000 毫升","适量","适量"]
    },
    {
    	id:81,
    	name:"参归鲳鱼汤",
    	food: ["鲳鱼","党参","当归","熟地","山药","盐"],
        weight: ["500 克","15 克","15 克","15 克","15 克","适量"]
    },
    {
    	id:82,
    	name:"茄子蒸鱼片",
    	food: ["草鱼","茄子","盐","水淀粉","油","鸡精"],
        weight: ["300 克","500 克","8 克","10 克","100 毫升","2 克"]
    },
    {
    	id:83,
    	name:"海带排骨汤",
    	food: ["猪排骨","海带","盐","料酒","香油","葱段","姜片"],
        weight: ["400 克","150 克","适量","适量","适量","少许","少许"]
    },
    {
    	id:84,
    	name:"干贝蘑菇汤",
    	food: ["鲜蘑菇","干贝","鲜汤","油","料酒","盐","味精","香油"],
        weight: ["250 克","20 克","适量","适量","适量","适量","适量","适量"]
    },
    {
    	id:85,
    	name:"蚝油干贝节瓜脯",
    	food: ["节瓜","干贝","蚝油","生抽","盐","味精","上汤","油","水淀粉"],
        weight: ["2 个","20 克","适量","适量","适量","适量","适量","适量","适量"]
    },
    {
    	id:86,
    	name:"蒲瓜肾片汤",
    	food: ["蒲瓜","薏仁","香菇","猪肾","盐","味精"],
        weight: ["250 克","10 克","10 克","1 个","少许","少许"]
    },
    {
    	id:87,
    	name:"竹笙鲜菇汤",
    	food: ["竹笙","真姬菇","胡萝卜","芹菜叶","盐","油","味精","料酒"],
        weight: ["200 克","1 包","1 个","少许","适量","适量","适量","适量"]
    },
    {
    	id:88,
    	name:"菜花炒蛋",
    	food: ["嫩菜花","鸡蛋","油","料酒","鲜汤","白糖","盐","味精","酱油"],
        weight: ["250 克","2 个","适量","适量","适量","适量","适量","适量","适量"]
    },
    {
      id:89,
      name:"西芹炒肉丝",
      food: ["猪肉", "西芹", "彩椒", "胡萝卜","盐","鸡粉","水淀粉","料酒","食用油"],
      weight:["240克","90克","20克","少许","3克","2克","9毫升","3毫升","适量"]
    },
    {
      id: 90,
      name: "金玉猪肉卷",
      food: ["猪肉", "蛋清", "千张", "香菇", "彩椒", "白菜叶", "葱花", "盐", "鸡粉","生抽","生粉", "水淀粉",  "食用油"],
      weight: ["260克", "35克", "200克", "30克", "10克", "95克", "少许", "3克", "2克", "5毫升", "15克", "适量","适量"]
    },
    {
      id: 91,
      name: "陈皮瘦肉粥",
      food: ["猪肉", "水发大米", "水发陈皮丝", "姜丝", "葱花",  "盐", "鸡粉"],
      weight: ["20克", "200克", "5克", "30克", "少许", "少许","2克", "3克", ]
    },
    {
      id: 92,
      name: "鸭肉炒菌菇",
      food: ["鸭肉", "白玉菇", "香菇", "姜片", "蒜片", "盐", "鸡粉", "生抽", "料酒", "水淀粉", "食用油"],
      weight: ["170克", "100克", "60克", "少许", "少许", "3克", "2克", "2毫升", "4毫升", "5毫升", "适量"]
    },
    {
      id: 93,
      name: "黄豆马蹄鸭肉汤",
      food: ["鸭肉", "马蹄", "水发黄豆", "姜片", "盐", "料酒","鸡粉",],
      weight: ["500克", "110克", "120克", "20克", "2克", "20毫升",  "2克", ]
    },
    {
      id: 94,
      name: "清炖甲鱼",
      food: ["甲鱼块",  "姜片", "枸杞", "料酒", "盐", "鸡粉",],
      weight: ["500克", "少许", "少许","6毫升", "2克", "2克",]
    },
    {
      id: 95,
      name: "甲鱼滋阴汤",
      food: ["甲鱼块", "生地", "百部", "知母", "地骨皮", "葱段","姜片",  "料酒", "盐", "鸡粉",],
      weight: ["300克", "20克", "10克", "10克", "10克","少许", "少许", "适量", "3克", "2克",]
    },
    {
      id: 96,
      name: "甲鱼红枣粥",
      food: ["甲鱼块", "红枣", "水发大米",  "葱花", "姜片", "料酒", "盐", "鸡粉","食用油"],
      weight: ["300克", "7克", "200克",  "少许", "少许", "4毫升", "3克", "2克","适量"]
    },
    {
      id: 97,
      name: "葱爆羊肉",
      food: ["羊肉", "大葱", "料酒", "盐", "鸡粉", "酱油","油","味精","白糖"],
      weight: ["20克", "10克", "适量", "2克", "2克", "5克","5克","1克","适量"]
    },
    {
      id: 98,
      name: "青椒炒牛肉",
      food: ["青椒", "牛肉",  "盐", "味精", "酱油", "油"],
      weight: ["10克", "10克", "2克", "2克", "2克", "10克"]
    },
    {
      id: 99,
      name: "蚝油牛肉",
      food: [ "牛肉", "蚝油", "盐", "油", "葱","水淀粉","青椒","红椒","黄椒"],
      weight: ["30克", "5克", "15克", "15克", "3克", "10克", "10克", "10克", "5克"]
    },
    {
      id: 100,
      name: "洋葱炒牛肉",
      food: ["洋葱", "牛肉", "盐", "味精", "油"],
      weight: ["150克", "20克", "10克", "适量",  "10克"]
    },
    {
      id: 101,
      name: "酱牛肉",
      food: ["牛腱子肉", "葱","姜", "盐", "酱油","料酒", "清汤","八角","香叶","桂皮","肉桂","红枣"],
      weight: ["100克", "适量", "适量", "适量", "适量", "适量", "适量", "适量", "适量", "适量", "适量", "适量"]
    },
    {
      id: 102,
      name: "番茄小泥肠",
      food: ["小泥肠", "洋葱", "番茄酱", "盐", "味精", "油", "糖"],
      weight: ["150克", "100克", "20克", "10克", "10克","10克","适量"]
    },
    {
      id: 103,
      name: "冬瓜鲤鱼汤",
      food: ["鲤鱼", "冬瓜", "青菜", "盐", "生姜"],
      weight: ["200克", "150克", "50克", "适量","适量"]
    },
    {
      id: 104,
      name: "杞贞兔肉汤",
      food: ["兔肉", "女贞子", "枸杞子", "葱","酱油"],
      weight: ["500克", "10克", "10克", "适量", "适量"]
    },
    {
      id: 105,
      name: "杭椒鳝片",
      food: ["净鳝鱼肉", "杭椒段", "千张丝", "姜丝", "蒜末", "香葱末", "料酒", "醋", "蚝油", "盐", "鸡精", "胡椒粉"],
      weight: ["300克", "50克", "50克", "5克", "5克", "5克", "5克", "5克", "5克", "3克","少许", "少许"]
    },
  ];
  return meal;
}
module.exports = {
  getMeal:getMeal
}